MikroElektronika/core_packages/ARM/gcc_clang/def/nuvoton/NUC123LC2AE1/mcu.h
/* GCR GPD_IOCR Bit Field Definitions */
#define SYS_GPD_IOCR_GPD11_DS_Pos                11                                         /*!< GCR_T::GPD_IOCR: GPD11_DS Position */
#define SYS_GPD_IOCR_GPD11_DS_Msk                (0x3ul << SYS_GPD_IOCR_GPD11_DS_Pos)       /*!< GCR_T::GPD_IOCR: GPD11_DS Mask */

#define SYS_GPD_IOCR_GPD10_DS_Pos                10                                         /*!< GCR_T::GPD_IOCR: GPD10_DS Position */
#define SYS_GPD_IOCR_GPD10_DS_Msk                (0x3ul << SYS_GPD_IOCR_GPD10_DS_Pos)       /*!< GCR_T::GPD_IOCR: GPD10_DS Mask */

#define SYS_GPD_IOCR_GPD9_DS_Pos                 9                                          /*!< GCR_T::GPD_IOCR: GPD9_DS Position */
#define SYS_GPD_IOCR_GPD9_DS_Msk                 (0x3ul << SYS_GPD_IOCR_GPD9_DS_Pos)        /*!< GCR_T::GPD_IOCR: GPD9_DS Mask */

#define SYS_GPD_IOCR_GPD8_DS_Pos                 8                                          /*!< GCR_T::GPD_IOCR: GPD8_DS Position */
#define SYS_GPD_IOCR_GPD8_DS_Msk                 (0x3ul << SYS_GPD_IOCR_GPD8_DS_Pos)        /*!< GCR_T::GPD_IOCR: GPD8_DS Mask */

/* GCR REGWRPROT Bit Field Definitions */
#define SYS_REGWRPROT_REGWRPROT_Pos              0                                          /*!< GCR_T::REGWRPROT: REGWRPROT Position */
#define SYS_REGWRPROT_REGWRPROT_Msk              (0xFFul << SYS_REGWRPROT_REGWRPROT_Pos)    /*!< GCR_T::REGWRPROT: REGWRPROT Mask */

#define SYS_REGWRPROT_REGPROTDIS_Pos             0                                          /*!< GCR_T::REGWRPROT: REGPROTDIS Position */
#define SYS_REGWRPROT_REGPROTDIS_Msk             (1ul << SYS_REGWRPROT_REGPROTDIS_Pos)      /*!< GCR_T::REGWRPROT: REGPROTDIS Mask */

/* GCR GPA_MFPH Bit Field Definitions */
#define SYS_GPA_MFPH_GPA15_MFP_Pos               28                                         /*!< GCR_T::GPA_MFPH: GPA15_MFP Position */
#define SYS_GPA_MFPH_GPA15_MFP_Msk               (0x7ul << SYS_GPA_MFPH_GPA15_MFP_Pos)      /*!< GCR_T::GPA_MFPH: GPA15_MFP Mask */

#define SYS_GPA_MFPH_GPA14_MFP_Pos               24                                         /*!< GCR_T::GPA_MFPH: GPA14_MFP Position */
#define SYS_GPA_MFPH_GPA14_MFP_Msk               (0x7ul << SYS_GPA_MFPH_GPA14_MFP_Pos)      /*!< GCR_T::GPA_MFPH: GPA14_MFP Mask */

#define SYS_GPA_MFPH_GPA13_MFP_Pos               20                                         /*!< GCR_T::GPA_MFPH: GPA13_MFP Position */
#define SYS_GPA_MFPH_GPA13_MFP_Msk               (0x7ul << SYS_GPA_MFPH_GPA13_MFP_Pos)      /*!< GCR_T::GPA_MFPH: GPA13_MFP Mask */

#define SYS_GPA_MFPH_GPA12_MFP_Pos               16                                         /*!< GCR_T::GPA_MFPH: GPA12_MFP Position */
#define SYS_GPA_MFPH_GPA12_MFP_Msk               (0x7ul << SYS_GPA_MFPH_GPA12_MFP_Pos)      /*!< GCR_T::GPA_MFPH: GPA12_MFP Mask */

#define SYS_GPA_MFPH_GPA11_MFP_Pos               12                                         /*!< GCR_T::GPA_MFPH: GPA11_MFP Position */
#define SYS_GPA_MFPH_GPA11_MFP_Msk               (0x7ul << SYS_GPA_MFPH_GPA11_MFP_Pos)      /*!< GCR_T::GPA_MFPH: GPA11_MFP Mask */

#define SYS_GPA_MFPH_GPA10_MFP_Pos               8                                          /*!< GCR_T::GPA_MFPH: GPA10_MFP Position */
#define SYS_GPA_MFPH_GPA10_MFP_Msk               (0x7ul << SYS_GPA_MFPH_GPA10_MFP_Pos)      /*!< GCR_T::GPA_MFPH: GPA10_MFP Mask */

/* GCR GPB_MFPL Bit Field Definitions */
#define SYS_GPB_MFPL_GPB7_MFP_Pos                28                                         /*!< GCR_T::GPB_MFPL: GPB7_MFP Position */
#define SYS_GPB_MFPL_GPB7_MFP_Msk                (0x7ul << SYS_GPB_MFPL_GPB7_MFP_Pos)       /*!< GCR_T::GPB_MFPL: GPB7_MFP Mask */

#define SYS_GPB_MFPL_GPB6_MFP_Pos                24                                         /*!< GCR_T::GPB_MFPL: GPB6_MFP Position */
#define SYS_GPB_MFPL_GPB6_MFP_Msk                (0x7ul << SYS_GPB_MFPL_GPB6_MFP_Pos)       /*!< GCR_T::GPB_MFPL: GPB6_MFP Mask */

#define SYS_GPB_MFPL_GPB5_MFP_Pos                20                                         /*!< GCR_T::GPB_MFPL: GPB5_MFP Position */
#define SYS_GPB_MFPL_GPB5_MFP_Msk                (0x7ul << SYS_GPB_MFPL_GPB5_MFP_Pos)       /*!< GCR_T::GPB_MFPL: GPB5_MFP Mask */

#define SYS_GPB_MFPL_GPB4_MFP_Pos                16                                         /*!< GCR_T::GPB_MFPL: GPB4_MFP Position */
#define SYS_GPB_MFPL_GPB4_MFP_Msk                (0x7ul << SYS_GPB_MFPL_GPB4_MFP_Pos)       /*!< GCR_T::GPB_MFPL: GPB4_MFP Mask */

#define SYS_GPB_MFPL_GPB3_MFP_Pos                12                                         /*!< GCR_T::GPB_MFPL: GPB3_MFP Position */
#define SYS_GPB_MFPL_GPB3_MFP_Msk                (0x7ul << SYS_GPB_MFPL_GPB3_MFP_Pos)       /*!< GCR_T::GPB_MFPL: GPB3_MFP Mask */

#define SYS_GPB_MFPL_GPB2_MFP_Pos                8                                          /*!< GCR_T::GPB_MFPL: GPB2_MFP Position */
#define SYS_GPB_MFPL_GPB2_MFP_Msk                (0x7ul << SYS_GPB_MFPL_GPB2_MFP_Pos)       /*!< GCR_T::GPB_MFPL: GPB2_MFP Mask */

#define SYS_GPB_MFPL_GPB1_MFP_Pos                4                                          /*!< GCR_T::GPB_MFPL: GPB1_MFP Position */
#define SYS_GPB_MFPL_GPB1_MFP_Msk                (0x7ul << SYS_GPB_MFPL_GPB1_MFP_Pos)       /*!< GCR_T::GPB_MFPL: GPB1_MFP Mask */

#define SYS_GPB_MFPL_GPB0_MFP_Pos                0                                          /*!< GCR_T::GPB_MFPL: GPB0_MFP Position */
#define SYS_GPB_MFPL_GPB0_MFP_Msk                (0x7ul << SYS_GPB_MFPL_GPB0_MFP_Pos)       /*!< GCR_T::GPB_MFPL: GPB0_MFP Mask */

/* GCR GPB_MFPH Bit Field Definitions */
#define SYS_GPB_MFPH_GPB15_MFP_Pos               28                                         /*!< GCR_T::GPB_MFPH: GPB15_MFP Position */
#define SYS_GPB_MFPH_GPB15_MFP_Msk               (0x7ul << SYS_GPB_MFPH_GPB15_MFP_Pos)      /*!< GCR_T::GPB_MFPH: GPB15_MFP Mask */

#define SYS_GPB_MFPH_GPB14_MFP_Pos               24                                         /*!< GCR_T::GPB_MFPH: GPB14_MFP Position */
#define SYS_GPB_MFPH_GPB14_MFP_Msk               (0x7ul << SYS_GPB_MFPH_GPB14_MFP_Pos)      /*!< GCR_T::GPB_MFPH: GPB14_MFP Mask */

